/*
  string_h.h
  Работа со строками и прочие различные мелочи связанные с ними.
*/
#ifndef STRING_H_H
#define STRING_H_H
/*--------------------------------------------------------------------------*/
/*
  strgets_h.c
 */
char* strGets(char* str, int size_str);
/*--------------------------------------------------------------------------*/
/*
  strchar_h.c
*/
char* strChar(const char* str, int s);
/*--------------------------------------------------------------------------*/
/*
  chargets_h.c
*/
char charGets(void);
/*--------------------------------------------------------------------------*/
/*
  strnull_h.c
*/
char* strNull(char* str);
/*--------------------------------------------------------------------------*/
/*
  atoi_h.c
*/
int atoi_h(const char* str);
/*--------------------------------------------------------------------------*/
/*
  findstr_h.c
*/
char* findStr(const char* str, const char* substr);
/*--------------------------------------------------------------------------*/
#endif
