/*
  chargets_h.c
*/
/*--------------------------------------------------------------------------*/
// Заголовочные файлы.
#include <stdio.h>      /* Стандартный ввод вывод.*/

#include "../include/string_h.h"  /* Библиотека для работы со строками (harkut). */
/*--------------------------------------------------------------------------*/
/*
  char charGets(void)
  Описание:
  Аналог getchar(), но откидывает всё кроме 1 символа. Возвращает этот символ.
*/
char charGets(void) {
  int ch = 0;

  ch = getchar();
  while (getchar() != '\n') {}

  return ch;
}
