/*
  atoi_h.c
*/
/*--------------------------------------------------------------------------*/
// Заголовочные файлы.
#include <stdio.h>      /* Стандартный ввод вывод.*/

#include "../include/string_h.h"  /* Библиотека для работы со строками
                                     (harkut).  */
/*--------------------------------------------------------------------------*/
/*
  int atoi_h(const char* str)
  Описание:
  Получает аргументом указатель на начало строки str и переводим из строки в
  целое число.
*/
int atoi_h(const char* str) {
  short int i, n;
  n = 0;
  for (i = 0;
       str[i] >= '0' && str[i] <= '9';
       ++i) {
    n = 10 * n + (str[i] - '0');
  }
  return n;
}
